microbuilder/LPC11U_LPC13U_CodeBase/cmsis/startup_lpc11u_lpc13u_cr.c
        // LPC13U External Interrupts
		PIN_INT0_IRQHandler,	// All GPIO pin can be routed to PIN_INTx
		PIN_INT1_IRQHandler,
		PIN_INT2_IRQHandler,
		PIN_INT3_IRQHandler,
		PIN_INT4_IRQHandler,
		PIN_INT5_IRQHandler,
		PIN_INT6_IRQHandler,
		PIN_INT7_IRQHandler,
		GINT0_IRQHandler,
		GINT1_IRQHandler,		// PIO0 (0:7)
		0,
		0,
		OSTIMER_IRQHandler,
		0,
		SSP1_IRQHandler,		// SSP1
		I2C_IRQHandler,        	//  I2C
		CT16B0_IRQHandler,		// 16-bit Timer0
		CT16B1_IRQHandler,      // 16-bit Timer1
		CT32B0_IRQHandler,      // 32-bit Timer0
		CT32B1_IRQHandler,      // 32-bit Timer1
		SSP0_IRQHandler,        // SSP0
		USART_IRQHandler,       // USART
		USB_IRQHandler,         // USB IRQ
		USB_FIQHandler,         // USB FIQ
		ADC_IRQHandler,         // A/D Converter
		WDT_IRQHandler,         // Watchdog timer
		BOD_IRQHandler,         // Brown Out Detect
		FMC_IRQHandler,         // IP2111 Flash Memory Controller
		OSCFAIL_IRQHandler,     // OSC FAIL
		PVTCIRCUIT_IRQHandler,  // PVT CIRCUIT
		USBWakeup_IRQHandler,   // USB wake up
		0,
	};

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors")))
void
ResetISR(void) {

    //
    // Copy the data sections from flash to SRAM.
    //
	unsigned int LoadAddr, ExeAddr, SectionLen;
	unsigned int *SectionTableAddr;

	// Load base address of Global Section Table
	SectionTableAddr = &__data_section_table;

    // Copy the data sections from flash to SRAM.
	while (SectionTableAddr < &__data_section_table_end) {
		LoadAddr = *SectionTableAddr++;
		ExeAddr = *SectionTableAddr++;
		SectionLen = *SectionTableAddr++;
		data_init(LoadAddr, ExeAddr, SectionLen);
	}
	// At this point, SectionTableAddr = &__bss_section_table;
	// Zero fill the bss segment
	while (SectionTableAddr < &__bss_section_table_end) {
		ExeAddr = *SectionTableAddr++;
		SectionLen = *SectionTableAddr++;
		bss_init(ExeAddr, SectionLen);
	}

#ifdef __USE_CMSIS
	SystemInit();
#endif

#if defined (__cplusplus)
	//
	// Call C++ library initialisation
	//
	__libc_init_array();
#endif

#if defined(CMSIS_RTOS_ENABLE)
	osKernelInitialize();
	osThreadCreate(&os_thread_def_main, NULL);
	osKernelStart();
#else
#if defined (__REDLIB__)
	// Call the Redlib library, which in turn calls main()
__main() ;
#else
	main();
#endif
#endif
	//
	// main() shouldn't return, but if it does, we'll just enter an infinite loop
	//
	while (1) {
		;
	}
}

//*****************************************************************************
// Default exception handlers. Override the ones here by defining your own
// handler routines in your application code.
//*****************************************************************************
__attribute__ ((section(".after_vectors")))
void NMI_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void HardFault_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void MemManage_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void BusFault_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void UsageFault_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void SVC_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void DebugMon_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void PendSV_Handler(void) {
	while (1) {
	}
}
__attribute__ ((section(".after_vectors")))
void SysTick_Handler(void) {
	while (1) {
	}
}

//*****************************************************************************
//
// Processor ends up here if an unexpected interrupt occurs or a handler
// is not present in the application code.
//
//*****************************************************************************
__attribute__ ((section(".after_vectors")))
void IntDefaultHandler(void) {
	//
	// Go into an infinite loop.
	//
	while (1) {
	}
}

#else
#error "cr_startup.c: No MCU defined"
#endif



